names = ['N', 'S', 'T']
# index   0 |  1  |  2
ages_11 = [20, 30, 40]

people = list(zip(names, ages_11))          # СПИСОК
print(people)
# [('N', 20), ('S', 30), ('T', 40)]
# [('N', 20), ('S', 30), ('T', 40)] короче мы присваиваем одно к другому по индексу
print()

######################   это кортежи через ZIP
for i_person in people:
    print(i_person)
# ('N', 20)
# ('S', 30)
# ('T', 40)
######################   это СЛОВАРИ через ZIP
print()
people = dict(zip(names, ages_11))          # СПИСОК
print(people)
# {'N': 20, 'S': 30, 'T': 40}
##########################################Коприхеншенс можно еще с ЗИПОМ
people_2 = {
    i_name: i_age + 10
    for i_name, i_age in zip(names,ages_11)
}
print(people_2)                                 # можно и добавить что то типо +10


# зип выбрасывает число 2х множест У КОТОРОГО НЕТ ПАРЫ